In [54]:
import pandas as pd
import os
import numpy as np

In [31]:
import pandas as pd

#1.-----------------------------------------------------Get data from UL
URL1 = "https://vega.github.io/vega/data/airports.csv"
URL2 = "https://vega.github.io/vega/data/flights-airport.csv"
airports = pd.read_csv(URL1)
routes = pd.read_csv(URL2)

#Save  data from as CSV
airports.to_csv(os.getcwd() + "\\SNAFormative\\data-raw"+'\\airports.csv',index=False, header=True)
routes.to_csv(os.getcwd() + "\\SNAFormative\\data-raw" + '\\routes.csv',index=False, header=True)

In [37]:
df = pd.read_csv(".\\SNAFormative\\data-raw\\airports.csv")

In [43]:
df.set_index('iata', inplace=True)

KeyError: "None of ['iata'] are in the columns"

In [45]:
df.loc['01J', 'state']

'FL'

In [46]:
df['state']

iata
00M    MS
00R    TX
00V    CO
01G    NY
01J    FL
       ..
ZEF    NC
ZER    PA
ZPH    FL
ZUN    NM
ZZV    OH
Name: state, Length: 3376, dtype: object

In [47]:
df.shape

(3376, 6)

In [48]:
my_dict = {'Name':['Fred','Rashid','Nathan','Alice'],
           'Age': [55,34,46,35],
           'Job': ['Data Scientist', 'Rock Star', 'Dustman','Cow Poke']}

my_df = pd.DataFrame(my_dict)
print(my_df)

     Name  Age             Job
0    Fred   55  Data Scientist
1  Rashid   34       Rock Star
2  Nathan   46         Dustman
3   Alice   35        Cow Poke

In [49]:
print(my_df.loc[1,'Job'])

Rock Star

In [52]:
print(my_df.loc[0:2,'Name':'Job']) #And we can specify whole rows and columns: print(my_df.loc[0,:])

print(my_df.loc[:,'Name'])

     Name  Age             Job
0    Fred   55  Data Scientist
1  Rashid   34       Rock Star
2  Nathan   46         Dustman
0      Fred
1    Rashid
2    Nathan
3     Alice
Name: Name, dtype: object

In [55]:
my_df['email'] = ['fred@email.com','Missing','nat@email.com','NA']
my_df.loc[1,'Age'] = np.NaN
print(my_df)

     Name   Age             Job           email
0    Fred  55.0  Data Scientist  fred@email.com
1  Rashid   NaN       Rock Star         Missing
2  Nathan  46.0         Dustman   nat@email.com
3   Alice  35.0        Cow Poke              NA

In [58]:
my_df.replace('NA',np.nan,inplace=True)
my_df.replace('Missing',np.nan,inplace=True)

In [59]:
my_df

     Name   Age             Job           email
0    Fred  55.0  Data Scientist  fred@email.com
1  Rashid   NaN       Rock Star             NaN
2  Nathan  46.0         Dustman   nat@email.com
3   Alice  35.0        Cow Poke             NaN

In [60]:
my_df.dropna()

     Name   Age             Job           email
0    Fred  55.0  Data Scientist  fred@email.com
2  Nathan  46.0         Dustman   nat@email.com

In [61]:
my_df

     Name   Age             Job           email
0    Fred  55.0  Data Scientist  fred@email.com
1  Rashid   NaN       Rock Star             NaN
2  Nathan  46.0         Dustman   nat@email.com
3   Alice  35.0        Cow Poke             NaN

In [62]:
mask = (my_df['Name'] == 'Nathan') | (my_df['Job'] == 'Cow Poke') 
print(mask)

0    False
1    False
2     True
3     True
dtype: bool

In [63]:
my_dict = {'Name':['Fred','Rashid','Nathan','Alice','Georgia','Oaklynn','Pete','Ali'],
           'Age': [55,34,46,35,35,56,46,36],
           'Job': ['Data Scientist', 'Rock Star', 'Dustman','Cow Poke','Rock Star','Data Scientist','Cow Poke','Rock Star']}

my_df = pd.DataFrame(my_dict)
my_group = my_df.groupby(['Job'])
my_group.get_group('Rock Star')
print(my_group.get_group('Rock Star'))

      Name  Age        Job
1   Rashid   34  Rock Star
4  Georgia   35  Rock Star
7      Ali   36  Rock Star